Connected Services/servicioFacturacion2021/billService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsp200607="http://www.w3.org/2006/07/ws-policy" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:ns0="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" xmlns:ns1="http://service.sunat.gob.pe" xmlns:ns2="http://www.datapower.com/extensions/http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsp200409="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" targetNamespace="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:import namespace="http://service.sunat.gob.pe" location="billService?ns1.wsdl" />
  <wsdl:import namespace="http://www.datapower.com/extensions/http://schemas.xmlsoap.org/wsdl/soap12/" location="billService?ns2.wsdl" />
  <wsdl:types />
  <wsdl:binding name="BillServicePortBinding" type="ns1:billService">
    <soap11:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="getStatus">
      <soap11:operation soapAction="urn:getStatus" style="document" />
      <wsdl:input name="getStatusRequest">
        <soap11:body use="literal" />
      </wsdl:input>
      <wsdl:output name="getStatusResponse">
        <soap11:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sendBill">
      <soap11:operation soapAction="urn:sendBill" style="document" />
      <wsdl:input name="sendBillRequest">
        <soap11:body use="literal" />
      </wsdl:input>
      <wsdl:output name="sendBillResponse">
        <soap11:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sendPack">
      <soap11:operation soapAction="urn:sendPack" style="document" />
      <wsdl:input name="sendPackRequest">
        <soap11:body use="literal" />
      </wsdl:input>
      <wsdl:output name="sendPackResponse">
        <soap11:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="sendSummary">
      <soap11:operation soapAction="urn:sendSummary" style="document" />
      <wsdl:input name="sendSummaryRequest">
        <soap11:body use="literal" />
      </wsdl:input>
      <wsdl:output name="sendSummaryResponse">
        <soap11:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="billService">
    <wsdl:port name="BillServicePort" binding="ns0:BillServicePortBinding">
      <soap11:address location="https://e-factura.sunat.gob.pe:443/ol-ti-itcpfegem/billService" />
    </wsdl:port>
    <wsdl:port name="BillServicePort.0" binding="ns2:BillServicePortBinding">
      <soap12:address location="https://e-factura.sunat.gob.pe:443/ol-ti-itcpfegem/billService" />
    </wsdl:port>
    <wsdl:port name="BillServicePort.3" binding="ns0:BillServicePortBinding">
      <soap11:address location="https://e-factura.sunat.gob.pe:443/ol-ti-itcpfegem/billService" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>